Revit 2027 API
ContinuousRailType.Projection Property
 The horizontal distance between the outer boundary of the rail and the path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Projection { get; }
Public ReadOnly Property Projection As Double
	Get
public:
property double Projection {
	double get ();
}
member Projection : float with get
Property Value
Double
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace